In [43]:
import pandas as pd
import numpy as np

In [44]:
data = {'Company':['GOOG','GOOG','FB','FB','ALPHABET','ALPHABET'],
       'Person':['Sarah','Frank','Fiona','Kendall','Roman','Crosby'],
       'Sales':[200,234,534,164,644,132]}

In [45]:
df = pd.DataFrame(data)

In [46]:
df

    Company   Person  Sales
0      GOOG    Sarah    200
1      GOOG    Frank    234
2        FB    Fiona    534
3        FB  Kendall    164
4  ALPHABET    Roman    644
5  ALPHABET   Crosby    132

In [47]:
df.groupby('Company').sum()

          Sales
Company
ALPHABET    776
FB          698
GOOG        434

In [48]:
df.groupby('Company').describe().transpose()

Company        ALPHABET          FB        GOOG
Sales count    2.000000    2.000000    2.000000
      mean   388.000000  349.000000  217.000000
      std    362.038672  261.629509   24.041631
      min    132.000000  164.000000  200.000000
      25%    260.000000  256.500000  208.500000
      50%    388.000000  349.000000  217.000000
      75%    516.000000  441.500000  225.500000
      max    644.000000  534.000000  234.000000

# CONCATENATING DATAFRAMES

In [49]:
import pandas as pd

In [50]:
df1 = pd.DataFrame(data={'A':['A0','A1','A2'],'B':['B0','B1','B2'],'C':['C0','C1','C2']},index=[0,1,2])

In [51]:
df2 = pd.DataFrame(data={'A':['A3','A4','A5'],'B':['B3','B4','B5'],'C':['C3','C4','C5']},index=[3,4,5])

In [52]:
df3 = pd.DataFrame(data={'A':['A6','A7','A8'],'B':['B6','B7','B8'],'C':['C6','C7','C8']},index=[6,7,8])

In [53]:
df1

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [54]:
df2

    A   B   C
3  A3  B3  C3
4  A4  B4  C4
5  A5  B5  C5

In [55]:
df3

    A   B   C
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8

In [56]:
pd.concat([df1,df2,df3])

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8

In [57]:
pd.concat([df1,df2,df3],axis=1)

     A    B    C    A    B    C    A    B    C
0   A0   B0   C0  NaN  NaN  NaN  NaN  NaN  NaN
1   A1   B1   C1  NaN  NaN  NaN  NaN  NaN  NaN
2   A2   B2   C2  NaN  NaN  NaN  NaN  NaN  NaN
3  NaN  NaN  NaN   A3   B3   C3  NaN  NaN  NaN
4  NaN  NaN  NaN   A4   B4   C4  NaN  NaN  NaN
5  NaN  NaN  NaN   A5   B5   C5  NaN  NaN  NaN
6  NaN  NaN  NaN  NaN  NaN  NaN   A6   B6   C6
7  NaN  NaN  NaN  NaN  NaN  NaN   A7   B7   C7
8  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8

In [58]:
df = pd.DataFrame({'col1':[1,2,3],
                  'col2':[333,444,555],
                  'col3':['a','b','c']})

In [59]:
df

   col1  col2 col3
0     1   333    a
1     2   444    b
2     3   555    c

In [60]:
df['col1'].nunique()

3

In [63]:
df[(df['col1']>1)&(df['col2']==444)]

   col1  col2 col3
1     2   444    b